<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
  <meta content="text/html; charset=windows-1252" http-equiv="content-type">
  <title>OD_help</title>
  <style> .parameter{font-weight:bold;} </style>
</head>
<body>
<h1>Beschreibung</h1>
<p>Dies ist das Hauptdisplay des Konfigurationsdialogs. Der Konfigurationsdialog kann mit Hilfe der Toolbar ge&ouml;nnet werden.
Das Display besteht im wesentlichen aus einer Navigationsleiste um das ausgew&auml;hlte Diagramm entsprechend konfigurieren zu k&ouml;nnen.</p>

<h1>Parameter</h1>
<p>Die folgenden Parameter sind verf&uuml;gbar:</p>
<ul>
  <li><span class="parameter">Diagrammname</span>: Eindeutiger Name zur Identifizierung der Diagramminstanz.</li>
</ul>

<h2>Parameter Darstellung</h2>
<ul>
  <li><span class="parameter">F&uuml;llfarbe</span>: F&uuml;llfarbe von Hintergrundfl&auml;chen (Standard: Globaler Parameter <i>atvFillColor</i>)</li>
  <li><span class="parameter">Schriftfarbe</span>: Schriftfarbe (Standard: Globaler Parameter <i>atvFontColor</i>)</li>
  <li><span class="parameter">Zeige "Vorschau" Schaltfl&auml;che (nur bei Popup)</span>: Aktiviert die Schaltfl&auml;che "Vorschau", wenn der Konfigurationsdialog in einem Popup ge&ouml;ffnet wurde.</li>
  <li><span class="parameter">Zeige "Zur&uuml;ck" Schaltfl&auml;che</span>: Aktiviert die Schaltfl&auml;che "Zur&uuml;ck", wenn der Konfigurationsdialog in einem Frame ge&ouml;ffnet wurde.</li>
</ul>

<h2>Parameter Optionen</h2>
<ul>
  <li><span class="parameter">URL f&uuml;r "Zur&uuml;ck"</span>: Gibt das Display an, welches ge&ouml;ffnet wird, wenn auf die Schaltfl&auml;che "Zur&uuml;ck" gedr&uuml;ckt wird.</li>
  <li><span class="parameter">Frame f&uuml;r "Zur&uuml;ck" Schaltfl&auml;che</span>: Gibt den Framenamen an, in dem das ausgew&auml;hlte Display ge&ouml;ffnet werden soll.</li>
</ul>

<h2>Parameter Sicherheit</h2>
<p>Au&szlig;erdem k&ouml;nnen &uuml;ber ensprechende Parameter die ben&ouml;tigten Rechte zum Laden und Speichern der Konfiguration vergeben werden:</p>
<ul>
  <li><span class="parameter">Ben&ouml;tigtes Recht</span>: Der Benutzer muss &uuml;ber dieses Recht verf&uuml;gen, um  die Funktion ausf&uuml;hren zu k&ouml;nnen.</li>
  <li><span class="parameter">Aktivierungsadresse</span>: Stimmt der Wert dieser Adresse mit dem "Aktivierungswert" &uuml;berein, ist die Funktion aktiviert.</li>
  <li><span class="parameter">Aktivierungswert</span>: Wert, von dem die Funktion aktiviert wird.</li>
</ul>
</body>
</html>