<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
  <meta content="text/html; charset=windows-1252" http-equiv="content-type">
  <title>OD_help</title>
  <style> .parameter{font-weight:bold;} </style>
</head>
<body>
<h1>Beschreibung</h1>
<p>Dieses Display stellt Werzeuge zur Steuerung des Highcharts-Diagramms bereit.
Es steuert den Modus der Anzeige (Livemodus), den Messzeiger 1 und 2 sowie die M&ouml;glichkeit den Konfigurationsdialog aufzurufen.</p>

<h1>Parameter</h1>
<p>Die nachstehenden Parameter stehen dem Benutzer zur Verf&uuml;gung:</p>
<ul>
  <li><span class="parameter">Diagrammname</span>: Eindeutiger Name zur Identifizierung der Chartinstanz.</li>
</ul>
<p>Darstellung:</p>
<ul>
  <li><span class="parameter">Zeige Live-Schaltfl&auml;che</span>: Erm&ouml;glicht das aktiveren oder deaktiveren des Livemodus.</li>
  <li><span class="parameter">Zeige Marker 1</span>: Aktiviert oder deaktiviert die Schaltfl&auml;che f&uuml;r den Messzeiger 1.</li>
  <li><span class="parameter">Zeige Marker 2</span>: Aktiviert oder deaktiviert die Schaltfl&auml;che f&uuml;r den Messzeiger 2.</li>
  <li><span class="parameter">Zeige Optionen</span>: Aktiviert oder deaktiviert die Schaltfl&auml;che f&uuml;r das Anzeigen des Konfigurationsdialogs.</li>
</ul>
<p>Optionen:</p>
<ul>
  <li><span class="parameter">Modus zum Anzeigen der Optionen</span>: M&ouml;gliche Modi: Pop-up, Trigger und Frame.</li>
  <li><span class="parameter">Triggername</span>: Definiert den zu feuernden Trigger wenn der Modus Trigger aktiviert ist.</li>
  <li><span class="parameter">Zielframe</span>: Definiert den Namen des Frames, wenn der Konfigurationsdialog in einem Frame ge&ouml;ffnet werden soll.</li>
</ul>

<p>Au&szlig;erdem k&ouml;nnen &uuml;ber ensprechende Parameter die ben&ouml;tigten Rechte zur Anzeige des Konfigurationsdialogs (Optionen),
zum Laden und Speichern der Konfiguration und zur Anzeige des Exportmen&uuml;s vergeben werden:</p>
<ul>
  <li><span class="parameter">Ben&ouml;tigtes Recht</span>: Der Benutzer muss &uuml;ber dieses Recht verf&uuml;gen, um  die Funktion ausf&uuml;hren zu k&ouml;nnen.</li>
  <li><span class="parameter">Aktivierungsadresse</span>: Stimmt der Wert dieser Adresse mit dem "Aktivierungswert" &uuml;berein, ist die Funktion aktiviert.</li>
  <li><span class="parameter">Aktivierungswert</span>: Wert, von dem die Funktion aktiviert wird.</li>
</ul>

</body>
</html>
