<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
  <meta content="text/html; charset=windows-1252" http-equiv="content-type">
  <title>OD_help</title>
  <style> .parameter{font-weight:bold;} </style>
</head>
<body>
<h1>Beschreibung</h1>
<p>&Uuml;ber diese Schaltfl&auml;che wird der Wert einer Adresse erh&ouml;ht oder verringert, wie mit der Schaltfl&auml;che "Erh&ouml;hen/Verringern".</p>
<p>Dar&uuml;ber hinaus wird der Trigger "valuechanged" mit dem neuen Wert (= erh&ouml;hter oder verringerter Wert) aktiviert.</p>
<p>Mit Hilfe einer Statusanzeige in Form eines zus&auml;tzlichen Rahmens kann zudem auch ein negativer Status des aktuellen Wertes und ein zus&auml;tzlich definierter Alarm dargestellt werden. Die Farben und Blinkintervalle werden in globalen Listen definiert.</p>
<h1>Parameter</h1>
<p>Dieses Steuerelement hat die folgenden allgemeinen Parameter:</p>
<ul>
  <li><span class="parameter">base</span>: Der Wert dieser Adresse wird entweder erh&ouml;ht oder verringert.</li>
  <li><span class="parameter">Alarmadresse</span>: Optional zus&auml;tzliche Adresse eines Alarms, welcher angezeigt werden soll.</li>
  <li><span class="parameter">Schrittweite zum Erh&ouml;hen</span>: Wert, um den der Wert von "base" erh&ouml;ht wird (Standard: 1)</li>
  <li><span class="parameter">Schrittweite zum Verringern</span>: Wert, um den der Wert von "base" verringert wird (Standard: 1)</li>
  <li><span class="parameter">Intervall [ms] (0 = aus)</span>: Legt fest, wie lange die Schaltfl&auml;che bet&auml;tigt werden muss, damit der Wert von "base" automatisch ge&auml;ndert wird (Standard: 150&nbsp;ms, d.&nbsp;h., wird die Schaltfl&auml;che kontinuierlich bet&auml;tigt, wird der Wert alle 150&nbsp;ms ge&auml;ndert).</li>
  <li><span class="parameter">Status&uuml;berwachung aktivieren</span>: Schaltet die Anzeige des aktuellen Wertestatus ein oder aus.</li>
  <li><span class="parameter">Statustrigger feuern</span>: Statt der Statusanzeige kann auch ein hier definierter Trigger global gefeuert werden.</li>
</ul>
Schrift:<br>
<ul>
  <li><span class="parameter">Schriftart</span>: Schriftart, die auf den Wert angewendet wird (Standard: Arial)</li>
  <li><span class="parameter">Gr&ouml;&szlig;e</span>: Schriftgr&ouml;&szlig;e, die auf den Wert angewendet wird (Standard: 12)</li>
  <li><span class="parameter">Farbe</span>:Farbe, die auf den Wert angewendet wird (Standard: Globaler Parameter <i>atvFontColor</i>)</li>
</ul>
Darstellung:<br>
<ul>
  <li><span class="parameter">F&uuml;llfarbe Schaltfl&auml;che</span>: F&uuml;llfarbe von Hintergrundfl&auml;chen (Standard: Globaler Parameter <i>atvFillColor</i>)</li>
  <li><span class="parameter">F&uuml;llfarbe Wertefeld</span>: Hintergrundfarbe des Wertefelds (Standard: wei&szlig;)</li>
  <li><span class="parameter">F&uuml;llfarbe Wertefeld inaktiv</span>: F&uuml;llfarbe des Wertefelds, wenn nicht aktiv (Standard: dunkelgrau)</li>
  <li><span class="parameter">F&uuml;llfarbe Pfeil</span>: F&uuml;llfarbe des Pfeils (Standard: Globaler Parameter <i>atvSymbolColor</i>)</li>
  <li><span class="parameter">Konturfarbe Schaltfl&auml;che gedr&uuml;ckt</span>: Farbe der Kontur, die bei Bet&auml;tigung einer der beiden Schaltfl&auml;chen eingestellt wird (Standard: wei&szlig;)</li>
  <li><span class="parameter">Fokus Konturfarbe</span>: Farbe der Kontur, die beim Fokus der Schaltfl&auml;che eingestellt wird (Standard: wei&szlig;)</li>
  <li><span class="parameter">Rahmenfarbe</span>: Farbe des Rahmens um das Steuerelement (Standard: Globaler Parameter <i>atvBorderColor</i>)</li>
  <li><span class="parameter">Statushinweis</span>: Spezifiziert die Darstellung des Status &uuml;ber eine definierte globale Liste (Standard: Globaler Parameter <i>atvStatusIndication</i>)</li>
  <li><span class="parameter">Alarmhinweis</span>: Spezifiziert die Darstellung des Alarms &uuml;berber eine definierte globale Liste (Standard: Globaler Parameter <i>atvAlarmIndication</i>)</li>
</ul>
Optionen:<br>
<ul>
  <li><span class="parameter">Minimum</span>: Legt das untere Limit f&uuml;r den zu &auml;ndernden Wert fest, d.&nbsp;h., wenn der aktuelle Wert mit diesem Minimum &uuml;bereinstimmt, wird er nicht weiter verringert (Standard: kein Minimum festgelegt).</li>
  <li><span class="parameter">Maximum</span>: Legt das obere Limit f&uuml;r den zu &auml;ndernden Wert fest, d.&nbsp;h., wenn der aktuelle Wert mit diesem Maximum &uuml;bereinstimmt, wird er nicht weiter erh&ouml;ht (Standard: kein Maximum festgelegt).</li>
  <li><span class="parameter">Konsistenzgruppe</span>: Name der Konsistenzgruppe.</li>
  <li><span class="parameter">Tab-Index</span>: Bestimmt die Reihenfolge, in der mit der Tabulatortaste zwischen den einzelnen Object Displays gewechselt werden kann</li>
  <li><span class="parameter">Tooltip</span>: Zeigt eine Tooltip Box mit dem eingegebenen Text an (Standard HTML-Elemente k&ouml;nnen auch eingegeben werden)</li>
</ul>
Sicherheit:
<ul>
  <li><span class="parameter">Ben&ouml;tigtes Recht</span>: Der Benutzer muss &uuml;ber dieses Recht verf&uuml;gen, um diese Schaltfl&auml;che zu aktivieren, d.&nbsp;h. eine der beiden Schaltfl&auml;chen bet&auml;tigen zu k&ouml;nnen.</li>
  <li><span class="parameter">Aktivierungsadresse</span>: Stimmt der Wert dieser Adresse mit dem "Aktivierungswert" &uuml;berein, ist das Steuerelement aktiv, so dass es bet&auml;tigt werden kann.</li>
  <li><span class="parameter">Aktivierungswert</span>: Wert, von dem das Steuerelement aktiviert wird</li>
</ul>
<div style="margin-left: 40px;">HINWEIS: Die Aktivierung des Steuerelements kann nur &uuml;ber das ben&ouml;tigte Recht konfiguriert werden oder nur &uuml;ber die Aktivierungsadresse und den Aktivierungswert oder &uuml;ber beide. Werden beide Einstellungen vorgenommen, muss der Benutzer das ben&ouml;tigte Recht besitzen und der Wert der "Aktivierungsadresse" muss mit dem "Aktivierungswert" identisch sein, andernfalls wird das Steuerelement nicht aktiviert.</div>
</body>
</html>
